# апишите функцию f, которая на вход принимает два числа a и b, и возводит число a в целую степень b с помощью рекурсии.


# a = 3
# b = 5



# def step(a,b):
#     if b==0:
#         return 1
#     elif b==0:
#         return a
#     elif b<0:
#         return 1/step(a, -b)
#     else:
#         return a*step(a,b-1)

# print(step(a, b))


# Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.


# a = 2
# b = 2

# def sum(a,b):
#     if b==0:
#         return a
#     elif a==0:
#         return b
#     else:
#         return sum(a+1,b-1)

# print(sum(a, b))
